class_name LevelsData

# 100 слов на 20 уровней
# Уровни 1-10: Буквы
# Уровни 11-20: Слоги
const LEVELS = [
	# --- УРОВНИ 1 - 10 (По буквам) ---
	["КОТ", "ДОМ", "СОН", "ЛЕС", "МЯЧ"],                                # Уровень 1
	["МАК", "НОС", "РОТ", "СЫР", "ЧАЙ"],                                # Уровень 2
	["СУП", "СОК", "ЛЕВ", "КИТ", "ДУБ"],                                # Уровень 3
	["МЕД", "УХО", "ЭХО", "ЛЕТО", "НЕБО"],                              # Уровень 4
	["МАМА", "ПАПА", "ВОДА", "РЫБА", "РУКА"],                            # Уровень 5
	["СТРЕКОЗА", "СКОВОРОДА", "ВЫКЛЮЧАТЕЛЬ", "ВЕЛОСИПЕД", "ПОЛОТЕНЦЕ"],  # Уровень 6
	["БИНОКЛЬ", "КОМПЬЮТЕР", "МАРГАРИТКА", "ПРИКЛЮЧЕНИЕ", "ВОДОПРОВОД"],  # Уровень 7
	["ВЕЗДЕХОД", "ПОДСОЛНУХ", "БУТЕРБРОД", "ТЕЛЕВИЗОР", "КАРАНДАШ"],      # Уровень 8
	["ИГРУШКА", "ЭКСКУРСИЯ", "ПУТЕШЕСТВИЕ", "СМОРОДИНА", "ШОКОЛАД"],       # Уровень 9
	["ПРАЗДНИК", "СНЕЖИНКА", "ТЕЛЕФОН", "АВТОБУС", "ДИНОЗАВР"],            # Уровень 10

	# --- УРОВНИ 11 - 20 (По слогам) ---
	[["БЕ", "ЛОЧ", "КА"], ["КА", "РАН", "ДАШ"], ["КАР", "ТИН", "КА"], ["ПО", "ДУШ", "КА"], ["ИГ", "РУШ", "КА"]],         # Уровень 11
	[["ТЕТ", "РАДЬ"], ["О", "БЕЗЬ", "Я", "НА"], ["ЛО", "ПАТ", "КА"], ["АВ", "ТО", "БУС"], ["СА", "МО", "ЛЁТ"]],          # Уровень 12
	[["О", "ДУ", "ВАН", "ЧИК"], ["КРО", "ВАТ", "КА"], ["ПО", "ДРУЖ", "КА"], ["МЕД", "ВЕ", "ЖО", "НОК"], ["СИ", "НИЧ", "КА"]], # Уровень 13
	[["ПО", "ДА", "РОК"], ["ЗВЁЗ", "ДОЧ", "КА"], ["КЛУБ", "НИ", "КА"], ["ТРО", "ПИН", "КА"], ["ВО", "РО", "БЕЙ"]],       # Уровень 14
	[["КОМ", "НА", "ТА"], ["ТА", "РЕЛ", "КА"], ["РУЧ", "КА"], ["ЗЕР", "КА", "ЛО"], ["КАС", "ТРЮ", "ЛЯ"]],                # Уровень 15
	[["КО", "РОВ", "КА"], ["КОН", "ФЕТ", "КА"], ["ПО", "СЫЛ", "КА"], ["СА", "ПОЖ", "КИ"], ["СНЕ", "ЖИН", "КА"]],         # Уровень 16
	[["РЫ", "БАЛ", "КА"], ["КОР", "ЗИН", "КА"], ["РО", "МАШ", "КА"], ["ТРАМ", "ВАЙ", "ЧИК"], ["КУ", "БИК"]],              # Уровень 17
	[["ПИ", "РА", "МИД", "КА"], ["ЗА", "НА", "ВЕС", "КА"], ["ЛАС", "ТОЧ", "КА"], ["КО", "ЛО", "КОЛЬ", "ЧИК"], ["ПО", "ДУ", "ШЕЧ", "КА"]], # Уровень 18
	[["СО", "СУЛЬ", "КА"], ["МОР", "КОВ", "КА"], ["КА", "ЧЕ", "ЛИ"], ["СТО", "ЛО", "ВА", "Я"], ["КАР", "ТОШ", "КА"]],     # Уровень 19
	[["КА", "ПУС", "ТА"], ["ФОН", "ТАН", "ЧИК"], ["СКА", "МЕЙ", "КА"], ["КАР", "МАН", "ЧИК"], ["МО", "РО", "ЖЕ", "НО", "Е"]] # Уровень 20
]
